#pragma once

/* --------------------------- 序言 ---------------------------------*/

/**
 **********************************************************************
 *
 * (C) 2016 上海爱韦讯信息技术有限公司。
 *
 * @功能描述
 *
 **********************************************************************
*/

/* --------------------------- 文件包含 -----------------------------*/

/* --------------------------- 宏定义 -------------------------------*/

/* --------------------------- 类型定义 -----------------------------*/

/* --------------------------- 函数声明 -----------------------------*/
void process_dir(TCHAR *exe_name, TCHAR *output_dir_in);
void compose_sdy_source_path(char *sdy_source_file_name, char *sdy_source_path_out);
void compose_ogfx_file_name(char *father_file_name, char *file_name_in, char *ogfx_file_name);
char *get_distrib_dir(void);
char *get_output_dir(void);
